[
    {
        "id": 1,
        "title": "Mengenal Apa Itu Tailwind CSS",
        "image": "",
        "author": "Aan Widianto",
        "created_at": "2025-02-02",
        "content": [
            {
                "type": "3",
                "text": "Jadi, kalau kamu lagi cari cara gampang buat bikin desain web, Tailwind CSS bisa jadi pilihan yang tepat! Ini adalah framework CSS yang pake pendekatan utility-first, jadi kamu nggak perlu repot-repot bikin class .button atau .card kayak di CSS biasa. Cukup pakai aja class-class siap pakai yang udah disediain, kayak bg-blue-500, text-white, dan lain-lain. Jadi, kamu tinggal fokus ke desain, nggak usah pusing-pusing nulis CSS panjang lebar."
            },
            {
                "type": "1",
                "text": "Kenapa Tailwind CSS Bikin Hidup Lebih Mudah?"
            },
            {
                "type": "5",
                "text": "Utility-First, Tailwind ngasih kamu class utilitas yang bisa langsung dipake buat atur banyak hal di HTML. Misalnya, buat ngasih padding, tinggal pakai class p-4, buat margin m-4, dan kalau mau ganti background tinggal pakai bg-blue-500. Gak perlu nulis CSS tambahan lagi!\nDesain Responsif Gampang, Tailwind udah siapin kelas-kelas responsif kayak sm:, md:, lg:, jadi kamu bisa atur layout buat berbagai ukuran layar dengan gampang tanpa repot nulis media query.\nKustomisasi Sesuka Hati, Walaupun Tailwind udah punya default yang oke banget, kamu tetap bisa custom semua hal lewat file tailwind.config.js. Misalnya, ganti warna, ukuran, dan bahkan font sesuai style yang kamu pengen.\nCepet Banget untuk Develop, Karena nggak perlu banyak nulis CSS, kamu bisa lebih fokus bikin desain dan layout. Bikin website jadi lebih cepet!"
            },
            {
                "type": "1",
                "text": "Contoh Pake Tailwind CSS"
            },
            {
                "type": "3",
                "text": "Misalnya kamu pengen bikin tombol dengan background biru, tulisan putih, dan sedikit padding, kayak gini aja:"
            },
            {
                "type": "4",
                "text": "<button class=\"bg-blue-500 text-white p-2 rounded-md hover:bg-blue-600\">\n  Klik Saya\n</button>",
                "language": "1"
            },
            {
                "type": "3",
                "text": "Penjelasannya:"
            },
            {
                "type": "5",
                "text": "bg-blue-500: Jadi background-nya biru.\ntext-white: Teksnya jadi putih.\np-2: Ada padding di dalam tombol.\nrounded-md: Sudut tombol jadi agak membulat.\nhover:bg-blue-600: Kalau di-hover, tombol berubah jadi biru yang lebih gelap."
            },
            {
                "type": "3",
                "text": "Jadi berikut keunggulan dan kekurangan dari tailwind css"
            },
            {
                "type": "3",
                "text": "Keunggulan:"
            },
            {
                "type": "5",
                "text": "Super cepat buat bikin layout dan desain.\nCustomization tinggi, tinggal atur di config-nya.\nMudah dipake di project yang udah ada."
            },
            {
                "type": "3",
                "text": "Kekurangan:"
            },
            {
                "type": "5",
                "text": "HTML jadi berantakan dengan banyak class.\nButuh waktu adaptasi kalau kamu baru pertama kali coba framework ini."
            },
            {
                "type": "3",
                "text": "Kesimpulannya Tailwind CSS tuh keren banget buat kamu yang pengen desain web cepat tanpa banyak pusing mikirin CSS. Pendekatannya yang utility-first bikin semua jadi lebih praktis dan terstruktur. Jadi, kalau kamu pengen nyobain framework CSS yang fleksibel dan efisien, Tailwind bisa jadi pilihan tepat buat kamu!"
            }
        ],
        "tags": [3, 5]
    },
    {
        "id": 2,
        "title": "Membuat Aplikasi Next.js Pertama Kamu",
        "image": "",
        "author": "Aan Widianto",
        "created_at": "2025-02-02",
        "content": [
            {
                "type": "1",
                "text": "Mempersiapan Project"
            },
            {
                "type": "3",
                "text": "Untuk memulai, pertama-tama pastikan kamu sudah menginstall Next.js 13. Lakukan dengan cara ini:"
            },
            {
                "type": "4",
                "text": "npx create-next-app@latest my-first-next-app",
                "language": "7"
            },
            {
                "type": "3",
                "text": "Ganti my-first-next-app dengan nama aplikasi kamu. Setelah selesai, masuk ke folder aplikasi kamu:"
            },
            {
                "type": "4",
                "text": "cd my-first-next-app",
                "language": "7"
            },
            {
                "type": "1",
                "text": "Menggunakan App Router"
            },
            {
                "type": "3",
                "text": "Langkah pertama, buat folder baru bernama app di dalam proyek kamu, jika belum ada.\nDi dalam folder app/, buat file page.js yang akan menjadi halaman utama (root) aplikasi kamu.\nSejak Next.js 13, kita mulai menggunakan App Router yang memungkinkan kita untuk bekerja dengan folder app/ daripada pages/. Di dalam folder app/, kita dapat mengatur rute (routes) dan layout aplikasi kita."
            },
            {
                "type": "1",
                "text": "Membuat Halaman Utama"
            },
            {
                "type": "3",
                "text": "Di dalam folder app, buat file page.js:"
            },
            {
                "type": "4",
                "text": "// app/page.js\n\nexport default function Home() {\n  return (\n    <div>\n      <h1>Selamat Datang di Aplikasi Next.js Pertama Kamu!</h1>\n      <p>Wah, kamu udah sukses bikin aplikasi pertama dengan App Router di Next.js 13!</p>\n    </div>\n  );\n}\n",
                "language": "1"
            },
            {
                "type": "3",
                "text": "Lalu, jalankan aplikasi dengan perintah:"
            },
            {
                "type": "4",
                "text": "npm run dev",
                "language": "7"
            },
            {
                "type": "3",
                "text": "Akses aplikasi kamu di http://localhost:3000. Kamu akan melihat teks 'Selamat Datang di Aplikasi Next.js Pertama Kamu!'"
            },
            {
                "type": "3",
                "text": "Kamu udah berhasil bikin aplikasi pertama kamu dengan Next.js! Gimana? Mudah kan?\nDengan Next.js, kamu bisa buat aplikasi React dengan cepat, bikin aplikasi yang SEO-friendly, dan bahkan dapet fitur seperti server-side rendering tanpa pusing. Kamu bisa terus eksplorasi lebih lanjut dengan menambahin fitur lainnya seperti API Routes, image optimization, dan lainnya.\nSo, keep coding dan jangan ragu buat bereksperimen lebih jauh! Kalau ada pertanyaan, langsung aja tanya. Semangat!"
            }
        ],
        "tags": [1, 2, 3, 4]
    }
]
